         MACRO
&NAME    DMAND
* Data block for MANDEL
&NAME    DS    0D
         DC    1D'0'   CREAL
         DC    1D'0'   CIMAG 8
         DC    D'0.0'  ZREAL 16
         DC    D'0.0'  ZIMAG 24
         DC    D'4.0'  BOUND 32
         DS    1PL4    ITER  40
         DC    PL4'1'  ONE   48
         DC    PL4'0'  ZERO  56
         DMO
         MEND
