//MANDEL JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=128K,
//           USER=HERC01,PASSWORD=CUL8TR
//RUNMAN EXEC ASSIST,PARM='BATCH'
//* ASM.SYSUT1 DD UNIT=SYSDA
//* ASM.SYSUT2 DD UNIT=SYSDA
//* ASM.SYSUT3 DD UNIT=SYSDA
//* ASM.SYSGO DD UNIT=SYSDA
//SYSIN DD *
$JOB  ASSIST   MANDEL
