//MANDEL JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=128K,
//           USER=HERC01,PASSWORD=CUL8TR
//RUNMAN EXEC ASMFCG
//ASM.SYSUT1 DD UNIT=SYSDA
//ASM.SYSUT2 DD UNIT=SYSDA
//ASM.SYSUT3 DD UNIT=SYSDA
//ASM.SYSGO DD UNIT=SYSDA
//SYSUDUMP DD SYSOUT=*
//ASM.SYSIN DD *
